Repository: KookKookKool/erp-flutter-nextjs-mysql
Catalog: frontend/lib/core/l10n/app_*.arb
Languages: th

# appTitle
source: SUN ERP
th: ซัน อีอาร์พี

# orgCodePrompt
source: Please enter your organization code
th: กรุณากรอกรหัสองค์กร

source: Login
th: เข้าสู่ระบบ

# registerOrg
source: Register Organization
th: สมัครการใช้งานองค์กร

source: Employee
th: พนักงาน

# noEmployees
source: No employees found
th: ไม่พบข้อมูลพนักงาน

source: Error
th: เกิดข้อผิดพลาด

source: Loading...
th: กำลังโหลด...

source: Home
th: หน้าหลัก

source: HRM
th: บุคลากร

source: Project
th: โครงการ

source: Purchasing
th: จัดซื้อ

source: Sales
th: ขาย

source: Inventory
th: คลังสินค้า

source: Accounting
th: บัญชี

source: Reports
th: รายงาน

source: Settings
th: ตั้งค่า

source: Logout
th: ออกจากระบบ

source: Select Language
th: เลือกภาษา

# orgCodeLabel
source: Organization Code
th: รหัสองค์กร

source: Username
th: ชื่อผู้ใช้

source: Forgot password?
th: ลืมรหัสผ่าน?

source: Employee Name
th: ชื่อพนักงาน

# employeePosition
source: Position
th: ตำแหน่งงาน

# employeeId
source: Employee ID: {id}
th: รหัสพนักงาน: {id}

source: Check In
th: ลงเวลาเข้า

source: Check Out
th: ลงเวลาออก

# leave
source: Request Leave
th: ขอลา

# leaveAdd
source: Add Leave
th: ขอลา

# taskTitle
source: Your Tasks
th: งานที่เกี่ยวข้องของคุณ

# taskItem
source: Task: Update customer info
th: งาน: อัปเดตข้อมูลลูกค้า

# projectTitle
source: Project
th: โปรเจ็ค

source: HR Announcement
th: ประกาศจาก HR

# hrAnnouncementTitle
source: Annual leave announcement
th: แจ้งวันหยุดประจำปี

# hrAnnouncementSubtitle
source: Company will be closed on 12-15 April
th: บริษัทจะหยุดทำการวันที่ 12-15 เมษายน

# employeeModule
source: Employee
th: พนักงาน

# attendanceModule
source: Attendance
th: บันทึกเวลา

# payrollModule
source: Payroll
th: เงินเดือน

# leaveModule
source: Leave
th: การลา

# leaveApprovalModule
source: Leave Approval
th: อนุมัติการลา

# announcementModule
source: Announcement
th: ประกาศ

# employeeListTitle
source: Employee List
th: รายชื่อพนักงาน

# employeeListContent
source: Employee list content here
th: เนื้อหารายชื่อพนักงาน

# attendanceTitle
source: Time Attendance
th: บันทึกเวลาเข้า-ออก

# attendanceContent
source: Attendance content here
th: เนื้อหาบันทึกเวลาเข้า-ออก

# payrollTitle
source: Payroll
th: เงินเดือน

# payrollContent
source: Payroll content here
th: เนื้อหาเงินเดือน

# leaveTitle
source: Leave Management
th: การลา

# leaveContent
source: Leave management content here
th: เนื้อหาการลา

# leaveApprovalTitle
source: Leave Approval
th: อนุมัติการลา

# leaveApprovalContent
source: Leave approval content here
th: เนื้อหาอนุมัติการลา

# projectTaskModule
source: Project Task
th: งานโปรเจ็ค

# projectTaskContent
source: Project task content here
th: เนื้อหางานโปรเจ็ค

# projectStatusModule
source: Project Status
th: สถานะงาน

# projectStatusContent
source: Project status content here
th: เนื้อหาสถานะงาน

# projectNotificationModule
source: Project Notification
th: แจ้งเตือนงาน

# projectNotificationContent
source: Project notification content here
th: เนื้อหาแจ้งเตือนงาน

# salesCustomerModule
source: Customer
th: ข้อมูลลูกค้า

# salesCustomerContent
source: Customer content here
th: เนื้อหาข้อมูลลูกค้า

# salesQuotationModule
source: Quotation/Order
th: ใบเสนอราคา/ใบสั่งขาย

# salesQuotationContent
source: Quotation/Order content here
th: เนื้อหาใบเสนอราคา/ใบสั่งขาย

# salesReportModule
source: Sales Report
th: รายงานการขาย

# salesReportContent
source: Sales report content here
th: เนื้อหารายงานบัญชี

# purchasingOrderModule
source: Purchase Order
th: ใบสั่งซื้อ

# purchasingOrderContent
source: Purchase order content here
th: เนื้อหาใบสั่งซื้อ

# purchasingSupplierModule
source: Supplier
th: ซัพพลายเออร์

# purchasingSupplierContent
source: Supplier content here
th: เนื้อหาซัพพลายเออร์

# purchasingReportModule
source: Purchasing Report
th: รายงานการจัดซื้อ

# purchasingReportContent
source: Purchasing report content here
th: เนื้อหารายงานการจัดซื้อ

# inventoryProductModule
source: Product/Material
th: สินค้า/วัตถุดิบ

# inventoryProductContent
source: Product/material content here
th: เนื้อหาสินค้า/วัตถุดิบ

# inventoryStockModule
source: Stock
th: สต็อกคงเหลือ

# inventoryStockContent
source: Stock content here
th: เนื้อหาสต็อกคงเหลือ

# inventoryTransactionModule
source: Transaction
th: รับ-จ่ายสินค้า

# inventoryTransactionContent
source: Transaction content here
th: เนื้อหารับ-จ่ายสินค้า

# accountingIncomeModule
source: Income/Expense
th: บัญชีรายรับ-รายจ่าย

# accountingIncomeContent
source: Income/expense content here
th: เนื้อหาบัญชีรายรับ-รายจ่าย

# accountingFinanceModule
source: Finance
th: งบการเงิน

# accountingFinanceContent
source: Finance content here
th: เนื้อหางบการเงิน

# accountingReportModule
source: Accounting Report
th: รายงานบัญชี

# accountingReportContent
source: Accounting report content here
th: เนื้อหารายงานบัญชี

# crmCustomerModule
source: CRM Customer
th: ข้อมูลลูกค้า CRM

# crmCustomerContent
source: CRM customer content here
th: เนื้อหาข้อมูลลูกค้า CRM

# crmHistoryModule
source: Contact History
th: ประวัติการติดต่อ

# crmHistoryContent
source: Contact history content here
th: เนื้อหาประวัติการติดต่อ

# crmActivityModule
source: Sales Activity
th: กิจกรรมการขาย

# crmActivityContent
source: Sales activity content here
th: เนื้อหากิจกรรมการขาย

# reportsDashboardModule
source: Dashboard
th: แดชบอร์ด

# reportsDashboardContent
source: Dashboard analytics content here
th: เนื้อหาแดชบอร์ดวิเคราะห์ข้อมูล

# settingsUserModule
source: User Management
th: จัดการผู้ใช้

# settingsUserContent
source: User management content here
th: เนื้อหาจัดการผู้ใช้

# settingsPermissionModule
source: Permission
th: สิทธิ์ผู้ใช้

# settingsPermissionContent
source: Permission content here
th: เนื้อหาสิทธิ์ผู้ใช้

# settingsConfigModule
source: System Config
th: ตั้งค่าระบบ

# settingsConfigContent
source: System config content here
th: เนื้อหาตั้งค่าระบบ

# settingsNotificationModule
source: Notification Center
th: ศูนย์แจ้งเตือน

# settingsNotificationContent
source: Notification center content here
th: เนื้อหาศูนย์แจ้งเตือน

source: Remember me
th: จดจำการเข้าสู่ระบบ

source: Add Employee
th: เพิ่มพนักงาน

source: Edit Employee
th: แก้ไขข้อมูลพนักงาน

source: Delete
th: ลบ

source: Save
th: บันทึก

source: Cancel
th: ยกเลิก

source: Confirm Delete
th: ยืนยันการลบ

# confirmDeleteMessage
source: Are you sure you want to delete this employee?
th: คุณแน่ใจหรือไม่ที่จะลบพนักงานคนนี้?

source: Change Image
th: เปลี่ยนรูปภาพ

source: Pick Start Date
th: เลือกวันที่เริ่มงาน

# searchHint
source: Search name or employee ID
th: ค้นหาชื่อหรือรหัสพนักงาน

source: Position
th: ตำแหน่ง

source: Name
th: ชื่อ

source: Surname
th: นามสกุล

# employeeIdLabel
source: Employee ID
th: รหัสพนักงาน

source: Level
th: ระดับ

source: Email
th: อีเมล

source: Phone
th: เบอร์โทร

source: Start Date
th: วันที่เริ่มงาน

source: Password
th: รหัสผ่าน

source: Show Password
th: แสดงรหัสผ่าน

source: Hide Password
th: ซ่อนรหัสผ่าน

source: OT Start
th: เวลา OT เข้า

source: OT End
th: เวลา OT ออก

source: OT Rate
th: เรท OT

# leaveTypeSick
source: Sick Leave
th: ลาป่วย

# leaveTypePersonal
source: Personal Leave
th: ลากิจ

# leaveTypeVacation
source: Vacation Leave
th: ลาพักร้อน

# leaveStatusPending
source: Pending
th: รออนุมัติ

# leaveStatusApproved
source: Approved
th: อนุมัติ

# leaveStatusRejected
source: Rejected
th: ไม่อนุมัติ

# addLeaveTitle
source: Add Leave
th: เพิ่มการลา

source: Leave Date
th: วันที่ลา

# leaveReason
source: Reason
th: เหตุผล

# leaveSave
source: Save
th: บันทึก

# leaveCancel
source: Cancel
th: ยกเลิก

source: Please select leave type
th: กรุณาเลือกประเภทการลา

source: Please select date
th: กรุณาเลือกวันที่ลา

source: Please enter reason
th: กรุณากรอกเหตุผล

# leaveTypeLabel
source: Leave Type
th: ประเภทการลา

# saveError
source: Failed to save leave request. Please try again.
th: ไม่สามารถบันทึกคำขอลาได้ กรุณาลองอีกครั้ง.

# otSelectRate
source: Select OT Rate
th: เลือกรอบ OT

# otApprove
source: Approve
th: อนุมัติ

# otReject
source: Reject
th: ปฏิเสธ

# otRequest
source: OT request(s)
th: คำขอ OT

# otNoRequests
source: No OT requests found
th: ไม่พบคำขอ OT

# otNoPendingRequests
source: No pending OT requests
th: ไม่มีคำขอ OT ที่รอดำเนินการ

source: Approve
th: อนุมัติ

source: Reject
th: ปฏิเสธ

source: Retry
th: ลองใหม่

# otStatusPending
source: Pending
th: รออนุมัติ

# otStatusApproved
source: Approved
th: อนุมัติแล้ว

# otStatusRejected
source: Rejected
th: ปฏิเสธ

# otReason
source: Reason: {reason}
th: เหตุผล: {reason}

# otApprovedWithRate
source: Approved (rate x{rate})
th: อนุมัติแล้ว (เรท x{rate})

# otApproveButton
source: Approve
th: อนุมัติ

# otRejectButton
source: Reject
th: ปฏิเสธ

# otSelectRateTitle
source: Select OT Rate
th: เลือกเรท OT

# otApproveOf
source: Approve OT of {name}
th: อนุมัติ OT ของ {name}

# otCancel
source: Cancel
th: ยกเลิก

# payrollEdit
source: Edit
th: แก้ไข

# payrollLastUpdated
source: Last updated: {date}
th: แก้ไขล่าสุด: {date}

# otHourShort
source: hr.
th: ชม.

# payrollSearchHint
source: Search employee (name or ID)
th: ค้นหาพนักงาน (ชื่อ หรือ รหัสพนักงาน)

# payrollLoading
source: Loading payroll data...
th: กำลังโหลดข้อมูลเงินเดือน...

# payrollExporting
source: Exporting PDF...
th: กำลังส่งออก PDF...

# payrollExport
source: Export PDF ({count} selected)
th: ส่งออก PDF ({count} คน)

# payrollExportConfirm
source: Export PDF for {count} employees?
th: ต้องการส่งออก PDF สำหรับ {count} คนหรือไม่?

# payrollExported
source: Payslips exported successfully!
th: ส่งออกสลิปเงินเดือนสำเร็จ!

# payrollNoData
source: No payroll data yet
th: ยังไม่มีข้อมูลเงินเดือน

# payrollNoDataDescription
source: Start by adding payroll data for employees to manage and export payslips.
th: เริ่มต้นโดยการเพิ่มข้อมูลเงินเดือนของพนักงานเพื่อจัดการและส่งออกสลิปเงินเดือน

# payrollAdd
source: Add Payroll
th: เพิ่มข้อมูลเงินเดือน

# payrollNoAvailableEmployee
source: No available employees
th: ไม่มีพนักงานที่ใช้ได้

# payrollNoAvailableEmployeeToAdd
source: No available employee to add
th: ไม่มีพนักงานที่สามารถเพิ่มได้

# payrollExportPayslipTitle
source: Export Payslip
th: ส่งออกสลิปเงินเดือน

# payrollAllSelected
source: Select employees to export payslips ({count} found)
th: เลือกพนักงานเพื่อส่งออกสลิป ({count} คนที่พบ)

# payrollSelectAll
source: Select All
th: เลือกทั้งหมด

# payrollClearSelection
source: Clear Selection
th: ยกเลิก

# payrollSelectedCount
source: {selected} of {total} selected
th: เลือกแล้ว {selected} จาก {total} คน

# payrollMultiSelectHint
source: You can select multiple employees
th: สามารถเลือกหลายคนได้

# payrollError
source: Failed to load payroll data
th: เกิดข้อผิดพลาดในการโหลดข้อมูล

# payrollTryAgain
source: Try Again
th: ลองใหม่

# payrollDeleteConfirm
source: Confirm Delete
th: ยืนยันการลบ

# payrollDeleteConfirmMsg
source: Delete payroll data for "{name}"?
th: คุณต้องการลบข้อมูลเงินเดือนของ "{name}" หรือไม่?

# payrollDelete
source: Delete
th: ลบ

# payrollClose
source: Close
th: ปิด

# payrollTypeLabel
source: Type:
th: ประเภท:

# payrollTypeMonthly
source: Monthly
th: รายเดือน

# payrollTypeDaily
source: Daily
th: รายวัน

# payrollType
source: {type, select, monthly {Monthly} daily {Daily} other {Unknown}}
th: {type, select, monthly {รายเดือน} daily {รายวัน} other {ไม่ระบุ}}

# payrollSalary
source: Salary:
th: เงินเดือน:

# payrollCreatedAt
source: Created at:
th: สร้างเมื่อ:

# payrollLastUpdatedLabel
source: Last updated:
th: แก้ไขล่าสุด:

# payrollNoSearchResult
source: No employees found for "{query}". Try another name or ID.
th: ไม่พบพนักงานที่ตรงกับ "{query}" ลองค้นหาด้วยชื่อหรือรหัสอื่น

# payrollNoSearchResultTitle
source: No search results
th: ไม่พบผลลัพธ์

# payrollNoSearchResultDescription
source: No employees found for "{query}". Try another name or ID.
th: ไม่พบพนักงานที่ตรงกับ "{query}" ลองค้นหาด้วยชื่อหรือรหัสอื่น

# payrollClearSearch
source: Clear Search
th: ล้างการค้นหา

# payrollNoEmployeeData
source: All employees already have payroll data or there are no employees in the system.
th: พนักงานทั้งหมดมีข้อมูลเงินเดือนแล้ว หรือยังไม่มีข้อมูลพนักงานในระบบ

# payrollSocialSecurity
source: Social Security
th: ประกันสังคม

# payrollSocialSecurityLabel
source: Social Security Amount
th: จำนวนเงินประกันสังคม

# payrollSocialSecurityHint
source: Enter social security amount
th: กรอกจำนวนเงินประกันสังคม

# payrollSalaryLabel
source: Salary Amount
th: จำนวนเงินเดือน

# payrollSalaryHintMonthly
source: e.g. 25000
th: เช่น 25000

# payrollSalaryHintDaily
source: e.g. 500
th: เช่น 500

# payrollSalaryRequired
source: Please enter salary amount
th: กรุณากรอกจำนวนเงินเดือน

# payrollSalaryInvalid
source: Invalid salary amount
th: จำนวนเงินเดือนไม่ถูกต้อง

# payrollBaht
source: Baht
th: บาท

# payrollSocialSecurityInvalid
source: Invalid social security amount
th: จำนวนเงินประกันสังคมไม่ถูกต้อง

# connectionError
source: Connection error. Please try again.
th: เกิดข้อผิดพลาดในการเชื่อมต่อ กรุณาลองใหม่อีกครั้ง

source: Success
th: สำเร็จ

source: OK
th: ตกลง

# newMemberRegistration
source: New Organization Registration
th: สมัครสมาชิกองค์กรใหม่

source: Previous Step
th: ขั้นตอนก่อนหน้า

source: Next Step
th: ขั้นตอนถัดไป

source: Submit Request
th: ส่งคำขอ

# organizationInfo
source: Organization Information
th: ข้อมูลองค์กร

# orgName
source: Organization Name *
th: ชื่อองค์กร *

# pleaseEnterOrgName
source: Please enter organization name
th: กรุณากรอกชื่อองค์กร

# orgCode
source: Organization Code *
th: รหัสองค์กร *

# codeForLogin
source: Code for login access
th: รหัสสำหรับเข้าสู่ระบบ

# pleaseGenerateOrgCode
source: Please generate organization code
th: กรุณาสร้างรหัสองค์กร

source: Generate New Code
th: สร้างรหัสใหม่

# orgEmail
source: Organization Email *
th: อีเมลองค์กร *

# pleaseEnterEmail
source: Please enter email address
th: กรุณากรอกอีเมล

source: Invalid email format
th: รูปแบบอีเมลไม่ถูกต้อง

# orgPhone
source: Phone Number *
th: หมายเลขโทรศัพท์ *

# pleaseEnterPhone
source: Please enter phone number
th: กรุณากรอกหมายเลขโทรศัพท์

# orgAddress
source: Address *
th: ที่อยู่ *

source: Please enter address
th: กรุณากรอกที่อยู่

# orgDescription
source: Description *
th: รายละเอียด *

source: Please enter description
th: กรุณากรอกรายละเอียด

# adminInfo
source: Administrator Information
th: ข้อมูลผู้ดูแลระบบ

# adminDescription
source: This person will be the system administrator for your organization
th: บุคคลนี้จะเป็นผู้ดูแลระบบขององค์กรของคุณ

# adminName
source: Administrator Name *
th: ชื่อผู้ดูแลระบบ *

# pleaseEnterAdminName
source: Please enter administrator name
th: กรุณากรอกชื่อผู้ดูแลระบบ

# adminEmail
source: Administrator Email *
th: อีเมลผู้ดูแลระบบ *

# passwordRequirement
source: Minimum 6 characters
th: อย่างน้อย 6 ตัวอักษร

source: Please enter password
th: กรุณากรอกรหัสผ่าน

# passwordTooShort
source: Password must be at least 6 characters
th: รหัสผ่านต้องมีอย่างน้อย 6 ตัวอักษร

source: Confirm Password *
th: ยืนยันรหัสผ่าน *

source: Please confirm password
th: กรุณายืนยันรหัสผ่าน

# passwordMismatch
source: Passwords do not match
th: รหัสผ่านไม่ตรงกัน

# confirmationInfo
source: Confirmation Information
th: ข้อมูลยืนยัน

source: Note
th: หมายเหตุ

# waitingApprovalNote
source: Your registration request has been submitted and is awaiting approval from our admin team. You will receive a notification email once approved.
th: คำขอสมัครของคุณได้ถูกส่งแล้วและกำลังรออนุมัติจากทีมผู้ดูแล คุณจะได้รับอีเมลแจ้งเตือนเมื่อได้รับการอนุมัติ

# businessTypeLabel
source: Business Type *
th: ประเภทธุรกิจ *

# businessTypeRetail
source: Retail
th: ค้าปลีก

# businessTypeWholesale
source: Wholesale
th: ค้าส่ง

# businessTypeManufacturing
source: Manufacturing
th: ผลิต

# businessTypeService
source: Service
th: บริการ

# businessTypeTechnology
source: Technology
th: เทคโนโลยี

# businessTypeEducation
source: Education
th: การศึกษา

# businessTypeHealthcare
source: Healthcare
th: สุขภาพ

# businessTypeFinance
source: Finance
th: การเงิน

# businessTypeConstruction
source: Construction
th: ก่อสร้าง

# businessTypeFood
source: Food & Beverage
th: อาหารและเครื่องดื่ม

# businessTypeLogistics
source: Logistics
th: โลจิสติกส์

# businessTypeTourism
source: Tourism
th: ท่องเที่ยว

# businessTypeOther
source: Other
th: อื่นๆ

source: Please select business type
th: กรุณาเลือกประเภทธุรกิจ

# employeeCountLabel
source: Employee Count *
th: จำนวนพนักงาน *

# employeeCount_1_10
source: 1-10 employees
th: 1-10 คน

# employeeCount_11_50
source: 11-50 employees
th: 11-50 คน

# employeeCount_51_100
source: 51-100 employees
th: 51-100 คน

# employeeCount_101_500
source: 101-500 employees
th: 101-500 คน

# employeeCount_501_1000
source: 501-1000 employees
th: 501-1000 คน

# employeeCount_1000plus
source: More than 1000 employees
th: มากกว่า 1000 คน

source: Please select employee count
th: กรุณาเลือกจำนวนพนักงาน

# websiteLabel
source: Website
th: เว็บไซต์

# websiteInvalidFormat
source: Website must start with http:// or https://
th: เว็บไซต์ต้องขึ้นต้นด้วย http:// หรือ https://

# pleaseEnterOrgCode
source: Please enter organization code
th: กรุณากรอกรหัสองค์กร

# invalidOrgCode
source: Invalid organization code
th: รหัสองค์กรไม่ถูกต้อง

# orgNotFound
source: Organization code not found
th: ไม่พบรหัสองค์กรนี้ในระบบ

# orgNotApproved
source: Organization is not approved or cannot login yet
th: องค์กรยังไม่สามารถเข้าใช้งานได้

# orgCheckError
source: Error checking organization
th: เกิดข้อผิดพลาดในการตรวจสอบองค์กร

# serverConnectionError
source: Error connecting to server
th: เกิดข้อผิดพลาดในการเชื่อมต่อเซิร์ฟเวอร์

source: Back
th: ย้อนกลับ

# languageSelection
source: Select Language
th: เลือกภาษา
